#include <iostream>
using namespace std;
int main(){
    //位运算符
    //对二进制位进行运算
    //& 与（同1为1，有0则0）
    //多个与运算时，从左到右进行运算
    short a = 1;  //001
    short b = 5;  //101
    //  001
    // &101
    //  001
    //根据如上所示的上下对位进行与运算，只有当两个位都为1时，结果才为1，否则为0
    //001 = 1
    cout << "a & b = " << (a & b) << endl;  //故此处输出为1

    //| 或（有1则1）
    //  001
    // |101
    //  101
    cout << "a | b = " << (a | b) << endl;  //故此处输出为5

    //^ 异或（相同为0）
    //  001
    // ^101
    //  100
    cout << "a ^ b = " << (a ^ b) << endl;  //故此处输出为4

    //~ 取反（0变1，1变0）
    a = 5;  
    //  0000 0000 0000 0101
    // ~1111 1111 1111 1010(补码)
    // 1111 1111 1111 1001(反码)
    // 1000 0000 0000 0110(原码)
     //-6
    cout << "~ a = " << (~a) << endl;  //故此处输出为-6

    //<< 左移（在左侧补0，右侧丢弃）
    //a=5时
    // 1位  1010
    // 2位  10100
    // 3位  101000
    // 4位  1010000
    // 5位  10100000
    // 6位  101000000
    // 7位  1010000000
    // 8位  10100000000
    cout << "a << 3 = " << (a << 3) << endl;  //故此处输出为40

    //>> 右移（在右侧补0，左侧丢弃）
    //a=5时
    // 1位 010
    // 2位 001
    cout << "a >> 2 = " << (a >> 2) << endl;  //故此处输出为1

    //复合赋值运算符
    //<<= 左移赋值（先左移，再赋值）
    //>>= 右移赋值（先右移，再赋值）
    //&= 与赋值（先与，再赋值）
    //|= 或赋值（先或，再赋值）
    //^= 异或赋值（先异或，再赋值）
    //~= 取反赋值（先取反，再赋值）

    return 0;
}
