//现在开始变量的学习
#include <iostream>
using namespace std;
int main(){
    //变量的定义和赋值
    int a = 10;
    cout << "a的值为：" << a << endl;
    //像这样我们完成了一次变量的使用
    /*
    变量有很多种
    整型如:
    short/short int 短整型,字节大小为2字节,存储范围为-32768~32767
    int 整型,字节大小为4字节,存储范围为-2147483648~2147483647
    long 长整型,字节大小为8字节,存储范围为-9223372036854775808~9223372036854775807
    long long 长长整型,字节大小为16字节,存储范围为-9223372036854775808~9223372036854775807
    浮点型如:
    float 单精度浮点型,字节大小为4字节,存储范围为-3.40282346638528e+38~3.40282346638528e+38
    double 双精度浮点型,字节大小为8字节,存储范围为-1.7976931348623157e+308~1.7976931348623157e+308
    long double 长双精度浮点型,字节大小为16字节,存储范围为-1.18923134775808~1.18923134775808


    char 字符型,字节大小为1字节,存储范围为0~255
    bool 布尔型,字节大小为1字节,存储范围为0~1
    string 字符串型,字节大小为1字节,存储范围为0~255

    无符号整型如:
    unsigned short/unsigned int 无符号短整型,字节大小为2字节,存储范围为0~65535
    unsigned int 无符号整型,字节大小为4字节,存储范围为0~4294967295
    unsigned long 无符号长整型,字节大小为8字节,存储范围为0~18446744073709551615
    unsigned long long 无符号长长整型,字节大小为16字节,存储范围为0~18446744073709551615
    无符号浮点型如:
    unsigned float 无符号单精度浮点型,字节大小为4字节,存储范围为0~3.40282346638528e+38
    unsigned double 无符号双精度浮点型,字节大小为8字节,存储范围为0~1.7976931348623157e+308
    unsigned long double 无符号长长双精度浮点型,字节大小为16字节,存储范围为0~1.18923134775808
    */

        //在除了这些，还有auto类型，自动类型推导
    //他会自动选择数据类型
    auto a = 10;    //此时为int类型
    cout << "a的值为：" << a << endl;
    //像这样我们完成了一次变量的使用

    //const类型，常量类型
    //他的值不能被改变
    //他的值必须在初始化时就确定
    const int b = 10;
    cout << "b的值为：" << b << endl;

    //cin输入变量
    int c;
    cout << "请输入一个整数：" << endl;
    cin >> c;
    cout << "你输入的整数为：" << c << endl;
}
